# 1.算数运算
# + - * / % //
# 2.比较运算
# > < >= <=
# 3.赋值运算
# n=1
# sum 0
# while n <100:
# sum = sum +n #sum+=n
# n=n+1 #n+=1
# 4.逻辑运算
# 1.and,并且,左右两端同时成立，结果才能成立
# 2.or,或者,左右两端有一个成立.结果就成立
# 3.not,非，非真既假，非假既真，

# 如果没有括号怎么办？
# 记住运算顺序：
# 先算括号>算not>and>or

# 当and和or以及not同时出现的时候，最好呢，加上括号，不会产生歧义或者不易理解的


# 5.成员运算
# in 判断xxx是否在xXxx中出现了
# not in 判断xxx是否不在xxxx中出现了

# a = 20
# b = 3
# c = a % b #10/3=3..,,.1
# d = a / b
# print(c)

#让用户输入一个数字，判断是否是35的倍数
# n = int(input("请输入一个数字"))

# if n % 35 ==0:
#     print("是")
# else:
#     print("不是")

    ##互换操作
# a = 20
# b = 30

# temp = a   #备份，有桌子
# a = b
# b = temp
# 此交换操作仅适用于python
# a,b = b, a
# print(a,b)


